Repository: czhovo/chekinana
Catalog: ios/Chekinana/Chekinana/Localizable.xcstrings
Source language: en
Languages: ja, zh_hans, zh_hant

# assistant.dialog.stats_excluded
source: Undated Cheki excluded from this date range: %lld.
ja: 記録日未設定のチェキ%lld枚は、この期間の集計から除外しました。
zh_hans: %lld张没有记录日期的切未计入此日期范围。
zh_hant: %lld 張沒有記錄日期的切未計入此日期範圍。

# assistant.dialog.stats_idol
source: %1$@: %2$lld Cheki
ja: %1$@：チェキ%2$lld枚
zh_hans: %1$@：%2$lld张切
zh_hant: %1$@：%2$lld 張切

# assistant.dialog.stats_total
source: Total: %1$lld Cheki (%2$lld with photos, %3$lld without photos).
ja: 合計：チェキ%1$lld枚（画像あり%2$lld枚、画像なし%3$lld枚）。
zh_hans: 共%1$lld张切（有图%2$lld张，无图%3$lld张）。
zh_hant: 共 %1$lld 張切（有圖 %2$lld 張，無圖 %3$lld 張）。

# assistant.dialog.stats_unassigned
source: Unassigned: %lld Cheki
ja: 未割り当て：チェキ%lld枚
zh_hans: 未分配：%lld张切
zh_hant: 未分配：%lld 張切

# assistant.dialog.stats_undated
source: Includes %lld Cheki without a record date.
ja: 記録日未設定のチェキ%lld枚を含みます。
zh_hans: 其中%lld张切没有记录日期。
zh_hant: 其中 %lld 張切沒有記錄日期。

# assistant.dialog.step_paused
source: The next step could not be prepared. Earlier confirmed changes were kept; ask again for the remaining step.
ja: 次の手順を準備できませんでした。それまでに確認した変更は保持されています。残りの手順をもう一度依頼してください。
zh_hans: 无法准备下一步。此前已确认的更改均已保留，请重新提出剩余步骤的需求。
zh_hant: 無法準備下一步。先前已確認的變更均已保留，請重新提出剩餘步驟的需求。

# assistant.dialog.subtitle
source: Talk about your Idols, Cheki, and Events
ja: 会話でアイドル・チェキ・イベントを管理
zh_hans: 聊聊你的偶像、拍立得和活动
zh_hant: 聊聊你的偶像、拍立得和活動

# assistant.dialog.target_changed
source: The requested item changed or is unavailable. Ask to list the current items and prepare a new preview.
ja: 対象の項目が変更されたか、利用できなくなりました。現在の項目を一覧表示して、新しいプレビューを準備するよう依頼してください。
zh_hans: 所请求的项目已变化或不可用。请重新要求列出当前项目并准备新预览。
zh_hant: 所請求的項目已變更或無法使用。請重新要求列出目前的項目並準備新預覽。

# assistant.dialog.text_only
source: Assistant accepts text only. You can manage Idols, existing Cheki, Events, and Cheki quantity records without photos.
ja: アシスタントはテキストのみ受け付けます。アイドル、既存のチェキ、イベント、写真なしのチェキ枚数記録を管理できます。
zh_hans: 助手仅接受文本，可管理偶像、既有拍立得、活动和无图拍立得数量记录。
zh_hant: 助手僅接受文字，可管理偶像、既有拍立得、活動及無圖拍立得數量紀錄。

# assistant.dialog.unassigned
source: Unassigned
ja: 未割り当て
zh_hans: 未分配
zh_hant: 未分配

# assistant.dialog.unclear_reference
source: I cannot tell which item you mean. Give its name or a result number. The pending preview is unchanged.
ja: どの項目を指しているか判断できません。名前または結果の番号を指定してください。確認待ちのプレビューは変更していません。
zh_hans: 无法确定你指的是哪一项。请提供名称或结果编号，待确认预览保持不变。
zh_hant: 無法確定你指的是哪一項。請提供名稱或結果編號，待確認預覽保持不變。

# assistant.dialog.unsupported
source: I could not safely match that request. Specify the Idol, Cheki record, Event, or date range. Nothing was changed.
ja: そのリクエストに合う操作を安全に特定できませんでした。アイドル、チェキ記録、イベント、または期間を指定してください。何も変更していません。
zh_hans: 无法安全确定该请求对应的操作。请明确偶像、拍立得记录、活动或日期范围，未更改任何内容。
zh_hant: 無法安全確定此請求對應的操作。請明確指定偶像、拍立得記錄、活動或日期範圍，未變更任何內容。

# assistant.dialog.updated_quantity
source: Saved. This record now contains %lld Cheki.
ja: 保存しました。この記録はチェキ%lld枚になりました。
zh_hans: 已保存，这条记录现有%lld张切。
zh_hant: 已儲存，這筆記錄現有 %lld 張切。

# assistant.dialog.with_photo
source: With photo
ja: 画像あり
zh_hans: 有图
zh_hant: 有圖

# assistant.dialog.without_photo
source: Without photo
ja: 画像なし
zh_hans: 无图
zh_hant: 無圖

# assistant.edit
source: Edit
ja: 編集
zh_hans: 编辑
zh_hant: 編輯

# assistant.error.connection_lost
source: The connection was lost. Your input was preserved; retry when the network is stable.
ja: 接続が切れました。入力は保持されています。ネットワークが安定したら再試行してください。
zh_hans: 网络连接中断。已保留原输入；网络稳定后可重试。
zh_hant: 網路連線中斷。已保留原輸入；網路穩定後可重試。

# assistant.error.detail
source: Error: %@
ja: エラー：%@
zh_hans: 错误：%@
zh_hant: 錯誤：%@

# assistant.error.event_not_found
source: No local Event matched. Add the Event first or use a date.
ja: 一致するローカルイベントがありません。先に追加するか、日付を使用してください。
zh_hans: 本地没有匹配的活动。请先添加或改用日期。
zh_hant: 本機沒有符合的活動。請先新增活動或改用日期。

# assistant.error.host
source: The service host could not be resolved. Your input was preserved; check the network and retry.
ja: サービスのホスト名を解決できません。入力は保持されています。ネットワークを確認して再試行してください。
zh_hans: 无法解析服务域名。已保留原输入；请检查网络后重试。
zh_hant: 無法解析服務主機名稱。已保留原輸入；請檢查網路後重試。

# assistant.error.idol_not_found
source: No local Idol matched. Add the Idol first or try another name.
ja: 一致するローカルアイドルがありません。先に追加するか、別の名前をお試しください。
zh_hans: 本地没有匹配的偶像。请先添加或改写名称。
zh_hant: 本機沒有符合的偶像。請先新增偶像或嘗試其他名稱。

# assistant.error.invalid_plan
source: No safe operation was produced. Add the missing details or rephrase the request.
ja: 安全に実行できる操作を作成できませんでした。情報を追加するか、言い換えてください。
zh_hans: 没有得到可安全执行的操作，请补充信息或换一种描述。
zh_hant: 無法產生可安全執行的操作，請補充資訊或換一種描述。

# assistant.error.local_changed
source: The selected local item changed. Choose it again.
ja: 選択したローカル項目が変更されました。もう一度選択してください。
zh_hans: 刚才选择的本地对象已变化，请重新选择。
zh_hant: 剛才選取的本機項目已變更，請重新選擇。

# assistant.error.model_output
source: The model returned a result that cannot be executed safely. Rephrase the request.
ja: モデルが安全に実行できない結果を返しました。リクエストを言い換えてください。
zh_hans: 模型返回了无法安全执行的结果，请改写需求。
zh_hant: 模型傳回了無法安全執行的結果，請重新描述需求。

# assistant.error.network
source: The natural-language service is unavailable. Your input was preserved; retry or cancel.
ja: 自然言語サービスを利用できません。入力は保持されています。再試行またはキャンセルしてください。
zh_hans: 自然语言服务暂时不可用。已保留原输入；可以重试或取消。
zh_hant: 目前無法使用自然語言服務。已保留原輸入；可以重試或取消。

# assistant.error.not_deployed
source: The natural-language service is not available at this address. Your input was preserved.
ja: このアドレスでは自然言語サービスを利用できません。入力は保持されています。
zh_hans: 当前地址尚未提供自然语言服务。已保留原输入。
zh_hant: 此位址尚未提供自然語言服務。已保留原輸入。

# assistant.error.offline
source: The device is offline. Your input was preserved; retry after reconnecting.
ja: オフラインです。入力は保持されています。接続後に再試行してください。
zh_hans: 当前无法连接网络。已保留原输入；联网后可重试。
zh_hant: 目前無法連接網路。已保留原輸入；連線後可重試。

# assistant.error.privacy
source: Possible credentials or local identifiers were detected. Remove sensitive content and retry.
ja: 認証情報またはローカル識別子の可能性があります。機密情報を削除して再試行してください。
zh_hans: 检测到可能的凭据或本地标识。请移除敏感内容后重试。
zh_hant: 偵測到可能的憑證或本機識別碼。請移除敏感內容後重試。

# assistant.error.rate_check
source: The request allowance cannot be checked right now. Your input was preserved.
ja: 現在利用枠を確認できません。入力は保持されています。
zh_hans: 暂时无法检查调用额度。已保留原输入。
zh_hant: 暫時無法檢查使用額度。已保留原輸入。

# assistant.error.rate_limited
source: Too many requests. Your input was preserved; try again later.
ja: リクエストが多すぎます。入力は保持されています。後でもう一度お試しください。
zh_hans: 请求过于频繁。已保留原输入，请稍后重试。
zh_hant: 請求過於頻繁。已保留原輸入，請稍後重試。

# assistant.error.rejected
source: This request is not supported yet. Try describing it another way.
ja: このリクエストにはまだ対応していません。別の表現をお試しください。
zh_hans: 这项请求暂不支持，请换一种描述。
zh_hant: 尚不支援這項請求，請換一種描述。

# assistant.error.request
source: The input did not meet safety limits and was not sent or executed. Shorten or rephrase it.
ja: 入力が安全制限を満たさないため、送信も実行もされませんでした。短くするか言い換えてください。
zh_hans: 输入不符合安全限制，未发送或执行。请缩短或改写。
zh_hant: 輸入不符合安全限制，未傳送或執行。請縮短或重新描述。

# assistant.error.service
source: The natural-language service is temporarily unavailable. Your input was preserved.
ja: 自然言語サービスは一時的に利用できません。入力は保持されています。
zh_hans: 自然语言服务暂时不可用。已保留原输入。
zh_hant: 暫時無法使用自然語言服務。已保留原輸入。

# assistant.error.service_response
source: The service response could not be parsed safely. Nothing was executed.
ja: サービスの応答を安全に解析できませんでした。何も実行されていません。
zh_hans: 服务返回了无法安全解析的内容，未执行任何操作。
zh_hant: 服務傳回了無法安全解析的內容，未執行任何操作。

# assistant.error.timeout
source: The natural-language request timed out. Your input was preserved; retry or cancel.
ja: 自然言語リクエストがタイムアウトしました。入力は保持されています。再試行またはキャンセルしてください。
zh_hans: 自然语言请求超时。已保留原输入；可以重试或取消。
zh_hant: 自然語言請求逾時。已保留原輸入；可以重試或取消。

# assistant.error.upstream
source: The language model is temporarily unavailable. Your input was preserved.
ja: 言語モデルは一時的に利用できません。入力は保持されています。
zh_hans: 语言模型暂时不可用。已保留原输入。
zh_hant: 暫時無法使用語言模型。已保留原輸入。

# assistant.error.upstream_timeout
source: The language model timed out. Your input was preserved.
ja: 言語モデルがタイムアウトしました。入力は保持されています。
zh_hans: 语言模型响应超时。已保留原输入。
zh_hant: 語言模型回應逾時。已保留原輸入。

# assistant.event_cancel_hint
source: Close the candidate without creating an Event
ja: イベントを作成せず候補を閉じます
zh_hans: 关闭候选且不创建活动
zh_hant: 關閉候選項目，不建立活動

# assistant.event_candidate
source: Event candidate · Not saved
ja: イベント候補 · 未保存
zh_hans: 活动候选 · 尚未保存
zh_hant: 候選活動 · 尚未儲存

# assistant.event_no_date
source: No date was found; the Event will be saved without a date.
ja: 日付が見つかりません。日付なしで保存します。
zh_hans: 未找到日期；将保存为无日期活动。
zh_hant: 未找到日期；將儲存為無日期活動。

# assistant.event_retry_hint
source: Call the Event extraction service again
ja: イベント抽出サービスを再度呼び出します
zh_hans: 重新调用活动提取服务
zh_hant: 重新呼叫活動擷取服務

# assistant.event.cancelled
source: The Event candidate was cancelled. No Event was saved.
ja: イベント候補をキャンセルしました。イベントは保存されていません。
zh_hans: 已取消活动候选，未保存活动。
zh_hant: 已取消候選活動，未儲存任何活動。

# assistant.event.client.characters
source: The post contains unsupported control characters. Remove them and try again.
ja: 投稿に未対応の制御文字が含まれています。削除して再試行してください。
zh_hans: 帖子正文包含不支持的控制字符，请移除后重试。
zh_hant: 貼文包含不支援的控制字元，請移除後重試。

# assistant.event.client.configuration
source: The Event extraction service address is invalid.
ja: イベント抽出サービスのアドレスが無効です。
zh_hans: 活动提取服务地址无效。
zh_hant: 活動擷取服務的位址無效。

# assistant.event.client.empty_text
source: Enter the full Weibo or X post text.
ja: WeiboまたはX投稿の全文を入力してください。
zh_hans: 请输入完整的 Weibo 或 X 正文。
zh_hant: 請輸入完整的 Weibo 或 X 貼文。

# assistant.event.client.invalid_url
source: Enter a public Weibo or X status URL.
ja: 公開WeiboまたはX投稿URLを入力してください。
zh_hans: 请输入公开的 Weibo 或 X 状态链接。
zh_hant: 請輸入公開的 Weibo 或 X 貼文連結。

# assistant.event.client.network
source: The Event extraction service is unavailable. Check the network and try again.
ja: イベント抽出サービスに接続できません。ネットワークを確認して再試行してください。
zh_hans: 当前无法连接活动提取服务，请检查网络后重试。
zh_hant: 目前無法連接活動擷取服務，請檢查網路後重試。

# assistant.event.client.response
source: The Event extraction response could not be parsed safely.
ja: イベント抽出サービスの応答を安全に解析できませんでした。
zh_hans: 无法安全解析活动提取服务的响应。
zh_hant: 無法安全解析活動擷取服務的回應。

# assistant.event.client.response_large
source: The Event extraction response was too large and was rejected.
ja: イベント抽出サービスの応答が大きすぎるため拒否しました。
zh_hans: 活动提取服务返回的数据过大，已拒绝处理。
zh_hant: 活動擷取服務傳回的資料過大，已拒絕處理。

# assistant.event.client.text_large
source: The post exceeds 32 KiB. Shorten it and try again.
ja: 投稿が32 KiBを超えています。短くして再試行してください。
zh_hans: 帖子正文超过32 KiB，请缩短后重试。
zh_hant: 貼文超過 32 KiB，請縮短後重試。

# assistant.event.client.timeout
source: Event extraction timed out. Try again later.
ja: イベント抽出がタイムアウトしました。後でもう一度お試しください。
zh_hans: 活动提取超时，请稍后重试。
zh_hant: 活動擷取逾時，請稍後重試。

# assistant.event.date_optional
source: YYYY-MM-DD or empty
ja: YYYY-MM-DD または空欄
zh_hans: YYYY-MM-DD 或留空
zh_hant: YYYY-MM-DD 或留空

# assistant.event.date_undetermined
source: Undetermined
ja: 未定
zh_hans: 未确定
zh_hant: 未定

# assistant.event.error.date
source: Use YYYY-MM-DD, or leave the date empty if it is undetermined.
ja: YYYY-MM-DDを使用するか、未定の場合は空欄にしてください。
zh_hans: 日期请使用 YYYY-MM-DD，未确定时可留空。
zh_hant: 日期請使用 YYYY-MM-DD，尚未確定時可留空。

# assistant.event.error.livehouse
source: The venue appears to include a street address. Keep only the venue name or clear it.
ja: 会場名に住所が含まれているようです。会場名だけにするか空欄にしてください。
zh_hans: 场地似乎包含道路或门牌地址，请只保留场地名称或清空。
zh_hant: 場地名稱似乎包含街道或門牌地址，請只保留場地名稱或清空。

# assistant.event.error.name
source: The Event name is required.
ja: イベント名は必須です。
zh_hans: 活动名称不能为空。
zh_hant: 活動名稱不可留空。

# assistant.event.error.ticket
source: Use an HTTPS URL on a trusted ticket site, or leave it empty.
ja: 信頼できるチケットサイトのHTTPS URLを使用するか、空欄にしてください。
zh_hans: 请使用受信任票务网站的 HTTPS URL，或留空。
zh_hant: 請使用可信任票務網站的 HTTPS 連結，或留空。

# assistant.event.error.too_long
source: %@ is too long. Shorten it before confirming.
ja: %@が長すぎます。確認前に短くしてください。
zh_hans: %@内容过长，请缩短后再确认。
zh_hant: %@的內容過長，請縮短後再確認。

# assistant.event.error.weibo
source: Enter a Weibo or X link.
ja: WeiboまたはXのリンクを入力してください。
zh_hans: 请输入微博或 X 链接。
zh_hant: 請輸入 Weibo 或 X 連結。

# assistant.event.extracted
source: Event details were extracted. Review every field; nothing has been saved yet.
ja: イベント情報を抽出しました。すべての項目を確認してください。まだ保存されていません。
zh_hans: 已提取活动信息，请检查所有字段；当前尚未保存。
zh_hant: 已擷取活動資訊，請檢查所有欄位；目前尚未儲存。

# assistant.event.field.address
source: Address
ja: 住所
zh_hans: 地址
zh_hant: 地址

# assistant.event.field.avatar
source: Avatar URL
ja: アバターURL
zh_hans: 头像链接
zh_hant: 頭像連結

# assistant.event.field.city
source: City
ja: 都市
zh_hans: 城市
zh_hant: 城市

# assistant.event.field.date
source: Date
ja: 日付
zh_hans: 日期
zh_hant: 日期

# assistant.event.field.images
source: Event image URL
ja: イベント画像URL
zh_hans: 活动图片链接
zh_hant: 活動圖片連結

# assistant.event.field.livehouse
source: Livehouse
ja: ライブハウス

# assistant.event.field.name
source: Name
ja: 名前
zh_hans: 名称
zh_hant: 名稱

# assistant.event.field.name_required
source: Name *
ja: 名前 *
zh_hans: 名称*
zh_hant: 名稱 *

# assistant.event.field.price
source: Price
ja: 料金
zh_hans: 票价
zh_hant: 票價

# assistant.event.field.ticket
source: Ticket URL
ja: チケットURL
zh_hans: 票务链接
zh_hant: 票務連結

# assistant.event.field.ticket_short
source: Tickets
ja: チケット
zh_hans: 票务
zh_hant: 票務

# assistant.event.field.weibo
source: Weibo / X URL
ja: Weibo / XのURL
zh_hans: Weibo / X 链接
zh_hant: Weibo / X 連結

# assistant.event.field.weibo_required
source: Weibo / X URL *
ja: Weibo / XのURL *
zh_hans: Weibo / X 链接*
zh_hant: Weibo / X 連結 *

# assistant.event.pending
source: Pending Event
ja: 確認待ちのイベント
zh_hans: 待确认活动
zh_hant: 待確認活動

# assistant.event.prepare_blocked
source: Correct the listed issues first
ja: 先に表示された問題を修正してください
zh_hans: 请先修正列出的问题
zh_hant: 請先修正列出的問題

# assistant.event.prepare_hint
source: Freeze these fields and create a confirmation card
ja: 現在の項目を確定して確認カードを作成します
zh_hans: 锁定当前字段并生成确认卡
zh_hant: 鎖定目前欄位並產生確認卡片

# assistant.event.prepare_wait
source: Wait for the current operation to finish
ja: 現在の操作が完了するまでお待ちください
zh_hans: 请等待当前操作完成
zh_hant: 請等待目前的操作完成

# assistant.event.reject.default
source: Event extraction failed (%@). Try again later.
ja: イベント抽出に失敗しました（%@）。後でもう一度お試しください。
zh_hans: 活动提取失败（%@），请稍后重试。
zh_hant: 活動擷取失敗（%@），請稍後重試。

# assistant.event.reject.invalid_url
source: This is not a supported public Weibo or X status URL.
ja: 対応している公開WeiboまたはX投稿URLではありません。
zh_hans: 该链接不是可处理的公开 Weibo 或 X 状态链接。
zh_hant: 此連結並非支援的公開 Weibo 或 X 貼文連結。

# assistant.event.reject.model_output
source: No safe Event details could be parsed. Check the post or enter the fields manually.
ja: 安全なイベント情報を解析できませんでした。投稿を確認するか、手動入力してください。
zh_hans: 未能安全解析活动信息，请检查正文或手动填写。
zh_hant: 無法安全解析活動資訊，請檢查貼文或手動填寫。

# assistant.event.reject.model_rejected
source: The Event could not be parsed. Check the post or enter the fields manually.
ja: イベントを解析できませんでした。投稿を確認するか、手動入力してください。
zh_hans: 无法解析活动，请检查正文或手动填写。
zh_hant: 無法解析活動，請檢查貼文或手動填寫。

# assistant.event.reject.model_timeout
source: The Event model timed out. Try again later.
ja: イベント解析モデルがタイムアウトしました。後でもう一度お試しください。
zh_hans: 活动解析模型超时，请稍后重试。
zh_hant: 活動解析模型逾時，請稍後重試。

# assistant.event.reject.model_unavailable
source: The Event model is temporarily unavailable. Try again later or enter the fields manually.
ja: イベント解析モデルを一時的に利用できません。後で再試行するか、手動入力してください。
zh_hans: 活动解析模型暂时不可用，请稍后重试或手动填写。
zh_hant: 暫時無法使用活動解析模型，請稍後重試或手動填寫。

# assistant.event.reject.not_found
source: This public Weibo or X status could not be read.
ja: この公開WeiboまたはX投稿を読み込めませんでした。
zh_hans: 无法读取这条公开 Weibo 或 X 状态。
zh_hant: 無法讀取這則公開的 Weibo 或 X 貼文。

# assistant.event.reject.rate
source: Too many requests. Try again later.
ja: リクエストが多すぎます。後でもう一度お試しください。
zh_hans: 请求过于频繁，请稍后重试。
zh_hant: 請求過於頻繁，請稍後重試。

# assistant.event.reject.service
source: Event extraction is temporarily unavailable. Try again later or enter the fields manually.
ja: イベント抽出を一時的に利用できません。後で再試行するか、手動入力してください。
zh_hans: 活动提取服务暂时不可用，请稍后重试或手动填写。
zh_hant: 暫時無法使用活動擷取服務，請稍後重試或手動填寫。

# assistant.event.reject.text
source: The Weibo or X post is invalid or too long. Check it and try again.
ja: WeiboまたはX投稿が無効か長すぎます。確認して再試行してください。
zh_hans: Weibo 或 X 正文无效或过长，请检查后重试。
zh_hant: Weibo 或 X 貼文無效或過長，請檢查後重試。

# assistant.event.reject.upstream_timeout
source: Reading the Weibo or X status timed out. Try again later.
ja: WeiboまたはX投稿の読み込みがタイムアウトしました。後でもう一度お試しください。
zh_hans: 读取 Weibo 或 X 状态超时，请稍后重试。
zh_hant: 讀取 Weibo 或 X 貼文逾時，請稍後重試。

# assistant.event.reject.weibo_timeout
source: Reading the Weibo or X post timed out. Try again later or enter the Event fields manually.
ja: WeiboまたはX投稿の読み込みがタイムアウトしました。後で再試行するか、イベント項目を手動入力してください。
zh_hans: 读取 Weibo 或 X 正文超时，请稍后重试或手动填写活动字段。
zh_hant: 讀取 Weibo 或 X 貼文逾時，請稍後重試或手動填寫活動欄位。

# assistant.event.reject.weibo_unavailable
source: The Weibo or X post is temporarily unavailable. Try again later or enter the Event fields manually.
ja: WeiboまたはX投稿を一時的に取得できません。後で再試行するか、イベント項目を手動入力してください。
zh_hans: 暂时无法读取 Weibo 或 X 正文，请稍后重试或手动填写活动字段。
zh_hant: 暫時無法讀取 Weibo 或 X 貼文，請稍後重試或手動填寫活動欄位。

# assistant.event.title
source: Event
ja: イベント
zh_hans: 活动
zh_hant: 活動

# assistant.history.cheki
source: %lld Cheki
ja: チェキ%lld枚
zh_hans: %lld张切
zh_hant: %lld 張切

# assistant.history.cheki.one
source: %lld Cheki
ja: チェキ%lld枚
zh_hans: %lld张切
zh_hant: %lld 張切

# assistant.history.cheki.other
source: %lld Cheki
ja: チェキ%lld枚
zh_hans: %lld张切
zh_hant: %lld 張切

# assistant.history.event
source: Event: %@
ja: イベント：%@
zh_hans: 活动：%@
zh_hant: 活動：%@

# assistant.history.events
source: Events: %@
ja: イベント：%@
zh_hans: 活动：%@
zh_hant: 活動：%@

# assistant.history.idol
source: Idol: %@
ja: アイドル：%@
zh_hans: 偶像：%@
zh_hant: 偶像：%@

# assistant.history.idol_cheki
source: Idol and Cheki results were returned.
ja: アイドルとチェキの結果を返しました。
zh_hans: 已返回偶像与拍立得结果。
zh_hant: 已傳回偶像與拍立得結果。

# assistant.history.idols
source: Idols: %@
ja: アイドル：%@
zh_hans: 偶像：%@
zh_hant: 偶像：%@

# assistant.history.scan
source: Scan complete: %lld Cheki
ja: スキャン完了：チェキ%lld枚
zh_hans: 扫描完成：%lld张切
zh_hant: 掃描完成：%lld 張切

# assistant.history.scan_warnings
source: Scan complete: %1$lld Cheki, %2$lld warnings
ja: スキャン完了：チェキ%1$lld枚、警告%2$lld件
zh_hans: 扫描完成：%1$lld张切，%2$lld条提醒
zh_hant: 掃描完成：%1$lld 張切，%2$lld 則提醒

# assistant.history.scan.one
source: Scan complete: %lld Cheki
ja: スキャン完了：チェキ%lld枚
zh_hans: 扫描完成：%lld张切
zh_hant: 掃描完成：%lld 張切

# assistant.history.scan.other
source: Scan complete: %lld Cheki
ja: スキャン完了：チェキ%lld枚
zh_hans: 扫描完成：%lld张切
zh_hant: 掃描完成：%lld 張切

# assistant.idol_candidates.cancelled
source: The Idol candidates were cancelled. Their previous buttons are no longer active.
ja: アイドル候補をキャンセルしました。以前のボタンは使用できません。
zh_hans: 已取消本次偶像候选，原候选按钮已失效。
zh_hant: 已取消本次候選偶像，原有的候選按鈕已失效。

# assistant.idol.added
source: Added %@.
ja: %@を追加しました。
zh_hans: 已添加%@。
zh_hant: 已新增%@。

# assistant.idol.added_announcement
source: Added %@.
ja: %@を追加しました。
zh_hans: 已添加%@。
zh_hant: 已新增%@。

# assistant.idol.avatar_cleanup_pending
source: The Idol was updated, but its previous managed avatar still needs cleanup.
ja: アイドルは更新されましたが、以前の管理対象アバターのクリーンアップが必要です。
zh_hans: 偶像已更新，但之前的托管头像仍需清理。
zh_hant: 偶像已更新，但先前由應用程式管理的頭像仍需清理。

# assistant.idol.confirmation_timeout
source: Idol confirmation timed out before saving. No Idol was saved, and the confirmation can be retried.
ja: 保存前にアイドルの確認がタイムアウトしました。アイドルは保存されておらず、確認を再試行できます。
zh_hans: 偶像确认在保存前超时；未保存偶像，可重新确认。
zh_hant: 偶像確認在儲存前逾時；未儲存偶像，可重新確認。

# assistant.idol.favorite.confirm
source: Favorite %@?
ja: %@をお気に入りに追加しますか？
zh_hans: 将%@设为收藏？
zh_hant: 將%@加入收藏？

# assistant.idol.unfavorite.confirm
source: Unfavorite %@?
ja: %@をお気に入りから外しますか？
zh_hans: 取消收藏%@？
zh_hant: 取消收藏%@？

# assistant.index_optional
source: Index (optional)
ja: 番号（任意）
zh_hans: 编号（可选）
zh_hant: 編號（選填）

# assistant.input_preserved
source: Your input was preserved
ja: 入力内容は保持されています
zh_hans: 原输入已保留
zh_hant: 已保留原輸入

# assistant.interpretation.cancelled
source: The request was cancelled. Your input and current selections were preserved.
ja: リクエストをキャンセルしました。入力と現在の選択は保持されています。
zh_hans: 已取消本次请求，并保留原输入和当前选择。
zh_hant: 已取消本次請求，並保留原輸入和目前的選擇。

# assistant.load_more
source: Load %1$lld more · %2$lld remaining
ja: さらに%1$lld件を表示 · 残り%2$lld件
zh_hans: 再加载%1$lld项 · 剩余%2$lld项
zh_hant: 再載入 %1$lld 項 · 剩餘 %2$lld 項

# assistant.load_more_hint
source: Show the next Idol cards
ja: 次のアイドルカードを表示します
zh_hans: 显示下一批偶像卡片
zh_hant: 顯示下一批偶像卡片

# assistant.navigation.opened
source: Opened %@.
ja: %@を開きました。
zh_hans: 已打开%@。
zh_hant: 已開啟%@。

# assistant.navigation.scan_opened
source: Opened Scan with the requested recognition settings.
ja: 指定された認識設定でスキャンを開きました。
zh_hans: 已按指定识别设置打开扫描。
zh_hant: 已依指定的辨識設定開啟掃描。

# assistant.navigation.unavailable
source: This navigation action is not available from the current presentation.
ja: 現在の表示からはこの移動操作を実行できません。
zh_hans: 当前展示方式暂不支持该导航操作。
zh_hant: 目前的顯示方式不支援這項導覽操作。

# assistant.no_local_idol
source: No local Idols
ja: ローカルアイドルがありません
zh_hans: 尚无本地偶像
zh_hant: 尚無本機偶像

# assistant.no_scan_results
source: No scan results are available. Select photos and scan first.
ja: 利用できるスキャン結果がありません。先に写真を選択してスキャンしてください。
zh_hans: 当前没有可用的扫描结果，请先选择照片并扫描。
zh_hant: 目前沒有可用的掃描結果，請先選擇照片並掃描。

# assistant.none
source: None
ja: なし
zh_hans: 无
zh_hant: 無

# assistant.not_set
source: Not set
ja: 未設定
zh_hans: 未设置
zh_hant: 未設定

# assistant.note
source: Note
ja: メモ
zh_hans: 备注
zh_hant: 備註

# assistant.optional
source: Optional
ja: 任意
zh_hans: 可留空
zh_hant: 可留空

# assistant.photo_processing.cancelled
source: Photo processing was cancelled. No new Cheki was created.
ja: 写真処理をキャンセルしました。新しいチェキは作成されていません。
zh_hans: 已取消照片处理，未创建新的拍立得。
zh_hant: 已取消照片處理，未建立新的拍立得。

# assistant.photo.batch_failed
source: error: The selected photos could not be loaded. No Cheki was prepared.
ja: エラー：選択した写真を読み込めませんでした。チェキは準備されていません。
zh_hans: 错误：无法读取所选照片，未准备拍立得。
zh_hant: 錯誤：無法讀取所選照片，未準備任何拍立得。

# assistant.photo.load_failed
source: The selected photos could not be loaded. Keep them selected and try again. %@
ja: 選択した写真を読み込めませんでした。選択を維持して再試行してください。%@
zh_hans: 无法读取所选照片，请保留选择后重试。%@
zh_hant: 無法讀取所選照片，請保留選擇後重試。%@

# assistant.photo.prepare_failed
source: error: A selected photo could not be prepared. No Cheki was prepared. %@
ja: エラー：選択した写真を準備できませんでした。チェキは準備されていません。%@
zh_hans: 错误：无法处理所选照片，未准备拍立得。%@
zh_hant: 錯誤：無法處理所選照片，未準備任何拍立得。%@

# assistant.photo.reading
source: Reading photo %1$lld/%2$lld…
ja: 写真を読み込み中%1$lld/%2$lld…
zh_hans: 正在读取照片%1$lld/%2$lld…
zh_hant: 正在讀取照片 %1$lld/%2$lld…

# assistant.photo.unreadable
source: One or more selected photos are unavailable or cannot be converted to image data.
ja: 選択した写真の一部を利用できないか、画像データに変換できません。
zh_hans: 一张或多张所选照片不可用，或无法转换为图像数据。
zh_hant: 一張或多張所選照片無法使用，或無法轉換為影像資料。

# assistant.photos_selected
source: %lld photos selected
ja: %lld枚の写真を選択
zh_hans: 已选择%lld张照片
zh_hant: 已選擇 %lld 張照片

# assistant.photos_selected_label
source: Selected photos
ja: 選択した写真
zh_hans: 已选择照片
zh_hant: 已選照片

# assistant.photos_selected.one
source: %lld photo selected
ja: 写真を%lld枚選択
zh_hans: 已选择%lld张照片
zh_hant: 已選擇 %lld 張照片

# assistant.photos_selected.other
source: %lld photos selected
ja: 写真を%lld枚選択
zh_hans: 已选择%lld张照片
zh_hant: 已選擇 %lld 張照片

# assistant.plan.stopped
source: Later operations were stopped safely. Complete the current choice or correct the error first.
ja: 後続の操作を安全に停止しました。現在の選択を完了するか、エラーを修正してください。
zh_hans: 后续操作已安全停止，请先完成当前选择或修正错误。
zh_hant: 已安全停止後續操作，請先完成目前的選擇或修正錯誤。

# assistant.prepare_confirmation
source: Prepare confirmation
ja: 確認を準備
zh_hans: 准备确认
zh_hant: 準備確認

# assistant.processing
source: Processing request
ja: リクエストを処理中
zh_hans: 正在处理请求
zh_hant: 正在處理請求

# assistant.prompt.complete
source: Complete this operation.
ja: この操作を完了してください。
zh_hans: 请完成本次操作。
zh_hant: 請完成本次操作。

# assistant.prompt.date
source: Choose a date.
ja: 日付を選択してください。
zh_hans: 请选择日期。
zh_hant: 請選擇日期。

# assistant.prompt.event_name
source: Enter an Event name. The URL, if any, was preserved.
ja: イベント名を入力してください。URLは保持されています。
zh_hans: 还需要活动名称。已保留 URL（如有）。
zh_hant: 請輸入活動名稱。已保留連結（如有）。

# assistant.prompt.event_or_date
source: Choose a local Event or use a date.
ja: ローカルのイベントを選ぶか、日付を使用してください。
zh_hans: 请选择一个本地活动，或使用日期。
zh_hant: 請選擇本機活動，或使用日期。

# assistant.prompt.idol
source: Choose at least one local Idol.
ja: ローカルのアイドルを1人以上選択してください。
zh_hans: 请选择至少一个本地偶像。
zh_hant: 請選擇至少一位本機偶像。

# assistant.prompt.idol_name
source: Enter the Idol name to add.
ja: 追加するアイドル名を入力してください。
zh_hans: 请补充要添加的偶像名称。
zh_hant: 請輸入要新增的偶像名稱。

# assistant.prompt.multiple_event
source: Multiple Events matched. Choose one.
ja: 複数のイベントが一致しました。1つ選択してください。
zh_hans: 找到多个匹配的活动，请选择一个。
zh_hant: 找到多個符合的活動，請選擇一個。

# assistant.prompt.multiple_idol
source: Multiple Idols matched. Choose one.
ja: 複数のアイドルが一致しました。1人選択してください。
zh_hans: 找到多个匹配的偶像，请选择一个。
zh_hant: 找到多位符合的偶像，請選擇一位。
